activagrogps/esp32-xbee/sdkconfig.defaults.esp32s3
# S3-only additions. IDF automatically appends this file AFTER
# sdkconfig.defaults when the target is esp32s3 (idf.py set-target esp32s3).
#
# NOTE: UART TX/RX pins (17/18 for UM980) are NOT set here - they are
# runtime configuration stored in NVS, set via the web UI (Config -> UART).
# Status LED pins for S3 are in main/status_led.c (#ifdef block).

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
